

* Working with Files

Read in data

#+begin_src python
mf = open("../picom/README.md", "r")
mf.readlines()
#+end_src

#+RESULTS:
| picom\n | =======\n | \n | **This is a development branch, bugs to be expected**\n | \n | This is forked from the original Compton because it seems to have become unmaintained.\n | \n | The current battle plan of this fork is to refactor it to make the code _possible_ to maintain, so potential contributors won't be scared away when they take a look at the code.\n | \n | We also try to fix bugs.\n | \n | You can leave your feedbacks or thoughts in the [discussion tab](https://github.com/yshui/picom/discussions).\n | \n | The original README can be found [here](README_orig.md)\n | \n | ## Call for testers\n | \n | ### `--experimental-backends`\n | \n | This flag enables the refactored/partially rewritten backends.\n | \n | Currently, new backends feature better vsync with the xrender backend and improved input lag with the glx backend (for non-NVIDIA users). The performance should be on par with the old backends.\n | \n | New backend features will only be implemented on the new backends from now on, and the old backends will eventually be phased out after the new backends stabilize.\n | \n | To test the new backends, add the `--experimental-backends` flag to the command you use to run picom. This flag is not available from the configuration file.\n | \n | To report issues with the new backends, please state explicitly you are using the new backends in your report.\n | \n | ## Rename\n | \n | ### Rationale\n | \n | Since the inception of this fork, the existence of two compton repositories has caused some number of confusions. Mainly, people will report issues of this fork to the original compton, or report issues of the original compton here. Later, when distros started packaging this fork of compton, some wanted to differentiate the newer compton from the older version. They found themselves having no choice but to invent a name for this fork. This is less than ideal since this has the potential to cause more confusions among users.\n | \n | Therefore, we decided to move this fork to a new name. Personally, I consider this more than justified since this version of compton has gone through significant changes since it was forked.\n | \n | ### The name\n | \n | The criteria for a good name were\n | \n | 0. Being short, so it's easy to remember.\n | 1. Pronounceability, again, helps memorability\n | 2. Searchability, so when people search the name, it's easy for them to find this repository.\n | \n | Of course, choosing a name is never easy, and there is no apparent way to objectively evaluate the names. Yet, we have to solve the aforementioned problems as soon as possible.\n | \n | In the end, we picked `picom` (a portmanteau of `pico` and `composite`) as our new name. This name might not be perfect, but is what we will move forward with unless there's a compelling reason not to.\n | \n | ### Migration\n | \n | Following the [deprecation process](https://github.com/yshui/picom/issues/114), migration to the new name will be broken into 3 steps:\n | \n | 1. All mentions of `compton` will be updated to `picom` in the code base. `compton` will still be installed, but only as a symlink to `picom`. When `picom` is launched via the symlink, a warning message is printed, alerting the user to migrate. Similarly, the old configuration file names and dbus interface names will still be accepted but warned.\n | 2. 3 major releases after step 1, the warning messages will be prompted to error messages and `picom` will not start when launched via the symlink.\n | 3. 3 major releases after step 2, the symlink will be removed.\n | \n | The dbus interface and service names are unchanged, so no migration needed for that.\n | \n | ## Change Log\n | \n | See [Releases](https://github.com/yshui/picom/releases)\n | \n | ## Build\n | \n | ### Dependencies\n | \n | Assuming you already have all the usual building tools installed (e.g. gcc, python, meson, ninja, etc.), you still need:\n | \n | * libx11\n | * libx11-xcb\n | * libXext\n | * xproto\n | * xcb\n | * xcb-damage\n | * xcb-xfixes\n | * xcb-shape\n | * xcb-renderutil\n | * xcb-render\n | * xcb-randr\n | * xcb-composite\n | * xcb-image\n | * xcb-present\n | * xcb-xinerama\n | * xcb-glx\n | * pixman\n | * libdbus (optional, disable with the `-Ddbus=false` meson configure flag)\n | * libconfig (optional, disable with the `-Dconfig_file=false` meson configure flag)\n | * libGL (optional, disable with the `-Dopengl=false` meson configure flag)\n | * libpcre (optional, disable with the `-Dregex=false` meson configure flag)\n | * libev\n | * uthash\n | \n | On Debian based distributions (e.g. Ubuntu), the needed packages are\n | \n | ```\n | libxext-dev libxcb1-dev libxcb-damage0-dev libxcb-xfixes0-dev libxcb-shape0-dev libxcb-render-util0-dev libxcb-render0-dev libxcb-randr0-dev libxcb-composite0-dev libxcb-image0-dev libxcb-present-dev libxcb-xinerama0-dev libxcb-glx0-dev libpixman-1-dev libdbus-1-dev libconfig-dev libgl1-mesa-dev libpcre2-dev libpcre3-dev libevdev-dev uthash-dev libev-dev libx11-xcb-dev meson\n | ```\n | \n | On Fedora, the needed packages are\n | \n | ```\n | dbus-devel gcc git libconfig-devel libdrm-devel libev-devel libX11-devel libX11-xcb libXext-devel libxcb-devel mesa-libGL-devel meson pcre-devel pixman-devel uthash-devel xcb-util-image-devel xcb-util-renderutil-devel xorg-x11-proto-devel\n | ```\n | \n | To build the documents, you need `asciidoc`\n | \n | ### To build\n | \n | ```bash\n | $ git submodule update --init --recursive\n | $ meson --buildtype=release . build\n | $ ninja -C build\n | ```\n | \n | Built binary can be found in `build/src`\n | \n | If you have libraries and/or headers installed at non-default location (e.g. under `/usr/local/`), you might need to tell meson about them, since meson doesn't look for dependencies there by default.\n | \n | You can do that by setting the `CPPFLAGS` and `LDFLAGS` environment variables when running `meson`. Like this:\n | \n | ```bash\n | $ LDFLAGS="-L/path/to/libraries" CPPFLAGS="-I/path/to/headers" meson --buildtype=release . build\n | \n | ```\n | \n | As an example, on FreeBSD, you might have to run meson with:\n | ```bash\n | $ LDFLAGS="-L/usr/local/lib" CPPFLAGS="-I/usr/local/include" meson --buildtype=release . build\n | $ ninja -C build\n | ```\n | \n | ### To install\n | \n | ``` bash\n | $ ninja -C build install\n | ```\n | \n | Default install prefix is `/usr/local`, you can change it with `meson configure -Dprefix=<path> build`\n | \n | ## How to Contribute\n | \n | ### Code\n | \n | You can look at the [Projects](https://github.com/yshui/picom/projects) page, and see if there is anything that interests you. Or you can take a look at the [Issues](https://github.com/yshui/picom/issues).\n | \n | ### Non-code\n | \n | Even if you don't want to contribute code, you can still contribute by compiling and running this branch, and report any issue you can find.\n | \n | Contributions to the documents and wiki will also be appreciated.\n | \n | ## Contributors\n | \n | See [CONTRIBUTORS](CONTRIBUTORS)\n |

Getting just the odd lines:

#+begin_src python
i = 0
my_output = open("my_output", "w")
mf = open("../../Downloads/rosalind_ini5.txt", "r")
for line in mf:
    if i % 2 == 1:
        my_output.write(line)
    i = i + 1
#+end_src

#+RESULTS:
: None
